In [44]:
import pandas as pd

# 01- How to find version

In [45]:
# Check pandas version
pd.__version__

'2.2.3'

In [46]:
# Another way to show pandas verison 
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 0691c5cf90477d3503834d983f69350f250a6ff7
python                : 3.13.1
python-bits           : 64
OS                    : Darwin
OS-release            : 20.6.0
Version               : Darwin Kernel Version 20.6.0: Thu Jul  6 22:12:47 PDT 2023; root:xnu-7195.141.49.702.12~1/RELEASE_X86_64
machine               : x86_64
processor             : i386
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : None.UTF-8

pandas                : 2.2.3
numpy                 : 2.2.3
pytz                  : 2025.1
dateutil              : 2.9.0.post0
pip                   : 25.1.1
Cython                : None
sphinx                : None
IPython               : 8.31.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : 4.12.3
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : 3.1.5
lxml.etree            : None
matplotlib            : 3.10.1
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : 1.15.2
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2025.1
qtpy                  : None
pyqt5                 : None

 
# 02- Make a DataFrame

In [47]:
df = pd.DataFrame({'Col A':[ 1,2,3], "Col B": [4,5,6]})
df

   Col A  Col B
0      1      4
1      2      5
2      3      6

In [48]:
# Array conversion to DataFrame
import numpy as np
array = np.array([[1,2,3], [4,5,6], [7,8,9]])
array

df = pd.DataFrame(array)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [49]:
# Creating a DataFrame with random floats 
df = pd.DataFrame(np.random.rand(4,8), columns=list('ABCDEFGH'))
df

,A,B,C,D,E,F,G,H
0,0.073981,0.055512,0.310994,0.309481,0.003543,0.075571,0.358125,0.709554
1,0.413765,0.384228,0.821004,0.161510,0.405663,0.904099,0.942651,0.764650
2,0.499416,0.337254,0.584723,0.920376,0.920106,0.424610,0.123314,0.305106
3,0.840062,0.852383,0.524384,0.534001,0.823744,0.087840,0.239911,0.059467

# 03- How to rename a columns?

In [50]:
# Creating a DataFrame with random integers and specific index and columns with names
df = pd.DataFrame(np.random.randint(1,11,size=(4,8))
                  ,columns=list("ABCDEFGH")
                  , index=['R1', 'R2', 'R3', 'R4'])
df

     A   B   C  D  E   F  G   H
R1   6   8   6  1  4  10  9   7
R2  10  10   2  8  1   5  6  10
R3   5   8   9  8  8   5  9   1
R4   6  10  10  5  4   8  6   3

In [51]:
df = pd.DataFrame(np.random.randint(1,21, size = (3,3)))
df

    0   1   2
0  17  10   6
1  19   8  15
2   6  17   1

In [52]:
# Change colums name
df.columns=['col1', 'col2','col3']
df

   col1  col2  col3
0    17    10     6
1    19     8    15
2     6    17     1

In [53]:
# Change rows name
df.index=["Row-1", "Row-2", "Row-3"]
df

       col1  col2  col3
Row-1    17    10     6
Row-2    19     8    15
Row-3     6    17     1

In [54]:
# to replace any charactor or string
df.columns = df.columns.str.replace("-","_")

df

       col1  col2  col3
Row-1    17    10     6
Row-2    19     8    15
Row-3     6    17     1

In [55]:
# adding perfix in columns
df = df.add_prefix("A_")
df

       A_col1  A_col2  A_col3
Row-1      17      10       6
Row-2      19       8      15
Row-3       6      17       1

In [56]:
# adding suffix in columns
df = df.add_suffix("_X")
df

       A_col1_X  A_col2_X  A_col3_X
Row-1        17        10         6
Row-2        19         8        15
Row-3         6        17         1

In [57]:
df.columns=["col-1", "col-2", 'col-3']
df

       col-1  col-2  col-3
Row-1     17     10      6
Row-2     19      8     15
Row-3      6     17      1

# 04- Using tamplate data

In [58]:
import pandas as pd
import numpy as np
import seaborn as sns

df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [59]:
# summary
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [60]:
# columns name
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [61]:
# rows count
df.index

RangeIndex(start=0, stop=891, step=1)

In [62]:
# save DataFrame to CSV
df.to_csv("zyx.csv")

In [63]:
# converted to excel
df.to_excel("xyz.xlsx")
df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

# 05- Using your own data

In [64]:
# read from excel
df = pd.read_csv("zyx.csv")
df

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

# 06- Reverse rows order

In [65]:
import pandas as pd
import seaborn as sns

In [66]:
df = sns.load_dataset("titanic")
df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [67]:
# reverse order
df.loc[::-1].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [68]:
# reset index 
df.loc[::-1].reset_index(drop=True).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

# 07- Reverse columns order

In [69]:
df.loc[:, ::-1].head(3)

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1

# 08- Select a colum by data type

In [70]:
# select only numeric columns
df.select_dtypes(include=["number"]).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [71]:
# select only categoryical value
df.select_dtypes(include=['category']).head()

   class deck
0  Third  NaN
1  First    C
2  Third  NaN
3  First    C
4  Third  NaN

In [72]:
# select only object type columns
df.select_dtypes(include='object').head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [73]:
#select only Float64 type columns
df.select_dtypes(include='Float64').head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [74]:
# select only number and category type columns
df.select_dtypes(include=['number', 'category']).head(3)

   survived  pclass   age  sibsp  parch     fare  class deck
0         0       3  22.0      1      0   7.2500  Third  NaN
1         1       1  38.0      1      0  71.2833  First    C
2         1       3  26.0      0      0   7.9250  Third  NaN

In [75]:
# select all columns except number type
# This will include all non-numeric columns such as object, category, etc.
df.select_dtypes(exclude=['number']).head()

      sex embarked  class    who  adult_male deck  embark_town alive  alone
0    male        S  Third    man        True  NaN  Southampton    no  False
1  female        C  First  woman       False    C    Cherbourg   yes  False
2  female        S  Third  woman       False  NaN  Southampton   yes   True
3  female        S  First  woman       False    C  Southampton   yes  False
4    male        S  Third    man        True  NaN  Southampton    no   True

In [76]:
# select all columns except category type
# This will include all non-category columns such as object, number, etc.
df.select_dtypes(exclude=['category']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,man,True,Southampton,no,True

# 09- convert numaric into string

In [77]:
#
df = pd.DataFrame({ "col_A" :[1,2,3,4,5],
                   'col_B' :[6,7,8,9,10]})
df.dtypes

col_A    int64
col_B    int64
dtype: object

In [78]:
# Convert column 'col_A' to string type and 'col_B' to string type
df.astype({'col_A': 'str', "col_B": 'str'}).dtypes

col_A    object
col_B    object
dtype: object

In [79]:
# Convert column 'col_A' to numeric type, coercing errors means that if there are any non-numeric values, they will be replaced with NaN
pd.to_numeric(df['col_A'],errors="coerce")

0    1
1    2
2    3
3    4
4    5
Name: col_A, dtype: int64

# 10- Reduce DataFrame size

In [80]:
# reduce the DataFrame to a sample of 10% of its rows
df = sns.load_dataset('titanic')

df.sample(frac=0.1).shape
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

# 11- copy DataFrame from clip board

In [81]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.to_excel("titanic_sample.xlsx", index=False)

In [82]:
# read from clipboard
df = pd.read_clipboard()
df

Empty DataFrame
Columns: [Filtering]
Index: []

# 12- Split dataframe in two subsets

In [83]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')

In [84]:
from random import random
df_1 = df.sample(frac=0.50, random_state=1 )
df_1.shape

(446, 15)

In [85]:
df_2 = df.drop(df_1.index)
df_2.shape

(445, 15)

In [86]:
df_1.head(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True

In [87]:
df_2.head(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True

In [88]:
df_1.shape

(446, 15)

In [89]:
df_2.shape

(445, 15)

In [90]:
len(df_2) + len(df_1)

891

# 13- Concat two datasets in one dataframe

In [91]:
df = pd.concat([df_1, df_2])
df.shape

(891, 15)

# 14- Filtering a dataframe

In [92]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [93]:
df.sex.unique()

array(['female', 'male'], dtype=object)

In [94]:
df[(df.sex=="male")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
623,0,3,male,21.0,0,0,7.8542,S,Third,man,True,NaN,Southampton,no,True
148,0,2,male,36.5,0,2,26.0000,S,Second,man,True,F,Southampton,no,False
34,0,1,male,28.0,1,0,82.1708,C,First,man,True,NaN,Cherbourg,no,False
794,0,3,male,25.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [95]:
df.who.unique()

array(['woman', 'man', 'child'], dtype=object)

In [96]:
df[(df.who=='child') & (df.age>14)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
111,0,3,female,14.5,1,0,14.4542,C,Third,child,False,NaN,Cherbourg,no,False
830,1,3,female,15.0,1,0,14.4542,C,Third,child,False,NaN,Cherbourg,yes,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
352,0,3,male,15.0,1,1,7.2292,C,Third,child,False,NaN,Cherbourg,no,False
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
689,1,1,female,15.0,0,1,211.3375,S,First,child,False,B,Southampton,yes,False

In [97]:
df[(df.alive=='yes')].shape

(342, 15)

In [98]:
df[(df.alive=='no')].shape

(549, 15)

In [99]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [100]:
df[
    ( (df.embark_town == 'Southampton') ) |
    ( (df.embark_town == 'Queenstown') & (df.alone == "True") )
]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False
623,0,3,male,21.0,0,0,7.8542,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True

In [103]:
filter_df = df [(
    (df.age >= 18) &
    (df.sex == "female") &
    (df.alive == 'yes')

)]

In [106]:
result = filter_df[['age', 'sex', 'alive']]
result

      age     sex alive
862  48.0  female   yes
3    35.0  female   yes
2    26.0  female   yes
437  24.0  female   yes
710  24.0  female   yes
..    ...     ...   ...
835  39.0  female   yes
856  45.0  female   yes
858  24.0  female   yes
879  56.0  female   yes
880  25.0  female   yes

[159 rows x 3 columns]

# 14- Filter by large category